<a href="https://colab.research.google.com/github/RsdTanmoy/Machine-Learning-Pandas/blob/main/Pandas_Lecture_9(GroupBy_Function).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Import Pandas and CSV file**

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [ ]:
import pandas as pd
df=pd.read_csv('/content/gdrive/MyDrive/Pandas/student_resultdata.csv')
df

   Student ID Section  ...  Mobile Games hrs  Percantege
0        1001       A  ...                 5          50
1        1002       A  ...                 0          80
2        1003       B  ...                 4          60
3        1004       C  ...                 5          45
4        1005       C  ...                 0          75
5        1006       B  ...                 0          96
6        1007       B  ...                 0          80
7        1008       A  ...                 0          90
8        1009       C  ...                 4          60
9        1010       B  ...                 0          85

[10 rows x 8 columns]

**Pandas GroupBy Function**

In [ ]:
gr1 = df.groupby(by='Section')
gr1

In [ ]:
gr1.groups

{'A': [0, 1, 7], 'B': [2, 5, 6, 9], 'C': [3, 4, 8]}

In [ ]:
df.groupby(['Section','Class']).groups

{('A', 10): [0, 1], ('A', 12): [7], ('B', 10): [2], ('B', 11): [5], ('B', 12): [6, 9], ('C', 11): [3, 4], ('C', 12): [8]}

In [ ]:
for Section,df_1 in gr1:
  print(Section)
  print(df_1)

A
   Student ID Section  ...  Mobile Games hrs  Percantege
0        1001       A  ...                 5          50
1        1002       A  ...                 0          80
7        1008       A  ...                 0          90

[3 rows x 8 columns]
B
   Student ID Section  ...  Mobile Games hrs  Percantege
2        1003       B  ...                 4          60
5        1006       B  ...                 0          96
6        1007       B  ...                 0          80
9        1010       B  ...                 0          85

[4 rows x 8 columns]
C
   Student ID Section  ...  Mobile Games hrs  Percantege
3        1004       C  ...                 5          45
4        1005       C  ...                 0          75
8        1009       C  ...                 4          60

[3 rows x 8 columns]

In [ ]:
list(gr1)

[('A',    Student ID Section  ...  Mobile Games hrs  Percantege
  0        1001       A  ...                 5          50
  1        1002       A  ...                 0          80
  7        1008       A  ...                 0          90

  [3 rows x 8 columns]),
 ('B',    Student ID Section  ...  Mobile Games hrs  Percantege
  2        1003       B  ...                 4          60
  5        1006       B  ...                 0          96
  6        1007       B  ...                 0          80
  9        1010       B  ...                 0          85

  [4 rows x 8 columns]),
 ('C',    Student ID Section  ...  Mobile Games hrs  Percantege
  3        1004       C  ...                 5          45
  4        1005       C  ...                 0          75
  8        1009       C  ...                 4          60

  [3 rows x 8 columns])]

In [ ]:
dict(list(gr1))

{'A':    Student ID Section  ...  Mobile Games hrs  Percantege
 0        1001       A  ...                 5          50
 1        1002       A  ...                 0          80
 7        1008       A  ...                 0          90

 [3 rows x 8 columns],
 'B':    Student ID Section  ...  Mobile Games hrs  Percantege
 2        1003       B  ...                 4          60
 5        1006       B  ...                 0          96
 6        1007       B  ...                 0          80
 9        1010       B  ...                 0          85

 [4 rows x 8 columns],
 'C':    Student ID Section  ...  Mobile Games hrs  Percantege
 3        1004       C  ...                 5          45
 4        1005       C  ...                 0          75
 8        1009       C  ...                 4          60

 [3 rows x 8 columns]}

**groupby.().get_group()**

In [ ]:
gr3=df.groupby('Class').get_group(10)
gr3

   Student ID Section  ...  Mobile Games hrs  Percantege
0        1001       A  ...                 5          50
1        1002       A  ...                 0          80
2        1003       B  ...                 4          60

[3 rows x 8 columns]

In [ ]:
gr3=df.groupby('Class').get_group(11)
gr3

   Student ID Section  ...  Mobile Games hrs  Percantege
3        1004       C  ...                 5          45
4        1005       C  ...                 0          75
5        1006       B  ...                 0          96

[3 rows x 8 columns]

In [ ]:
gr3=df.groupby('Class').get_group(12)
gr3

   Student ID Section  ...  Mobile Games hrs  Percantege
6        1007       B  ...                 0          80
7        1008       A  ...                 0          90
8        1009       C  ...                 4          60
9        1010       B  ...                 0          85

[4 rows x 8 columns]

In [ ]:
gr3=df.groupby('Section').get_group('A')
gr3

   Student ID Section  ...  Mobile Games hrs  Percantege
0        1001       A  ...                 5          50
1        1002       A  ...                 0          80
7        1008       A  ...                 0          90

[3 rows x 8 columns]

In [ ]:
gr3=df.groupby('Section').get_group('B')
gr3

   Student ID Section  ...  Mobile Games hrs  Percantege
2        1003       B  ...                 4          60
5        1006       B  ...                 0          96
6        1007       B  ...                 0          80
9        1010       B  ...                 0          85

[4 rows x 8 columns]

In [ ]:
gr3=df.groupby('Section').get_group('C')
gr3

   Student ID Section  ...  Mobile Games hrs  Percantege
3        1004       C  ...                 5          45
4        1005       C  ...                 0          75
8        1009       C  ...                 4          60

[3 rows x 8 columns]

 **Applying a Function**

In [ ]:
gr1.sum()

         Student ID  Class  ...  Mobile Games hrs  Percantege
Section                     ...
A              3011     32  ...                 5         220
B              4026     45  ...                 4         321
C              3018     34  ...                 9         180

[3 rows x 7 columns]

In [ ]:
gr1.mean()

          Student ID      Class  ...  Mobile Games hrs  Percantege
Section                          ...
A        1003.666667  10.666667  ...          1.666667   73.333333
B        1006.500000  11.250000  ...          1.000000   80.250000
C        1006.000000  11.333333  ...          3.000000   60.000000

[3 rows x 7 columns]

In [ ]:
gr1.describe()

        Student ID                                 ... Percantege
             count         mean       std     min  ...        25%   50%    75%   max
Section                                            ...
A              3.0  1003.666667  3.785939  1001.0  ...       65.0  80.0  85.00  90.0
B              4.0  1006.500000  2.886751  1003.0  ...       75.0  82.5  87.75  96.0
C              3.0  1006.000000  2.645751  1004.0  ...       52.5  60.0  67.50  75.0

[3 rows x 56 columns]

**Applying Multiple Functions**

In [ ]:
gr1.agg(['sum','max','mean'])

        Student ID                    Class  ... Mobile Games hrs Percantege
               sum   max         mean   sum  ...             mean        sum max       mean
Section                                      ...
A             3011  1008  1003.666667    32  ...         1.666667        220  90  73.333333
B             4026  1010  1006.500000    45  ...         1.000000        321  96  80.250000
C             3018  1009  1006.000000    34  ...         3.000000        180  75  60.000000

[3 rows x 21 columns]